FirstRoutesandControllers/first_Routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all #fetch all users

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Bob"], ["email", "bob@noarmsnolegs.com"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "bob@noarmsnolegs.net"], ["id", 10]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params) #calls update from ActiveRecord

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
    def destroy
        @user = User.find(params[:id]) #we can only destroy if we already have it
        @user.destroy